{
  "topicos": [
    {
      "id": "1",
      "titulo": "Como enviar e-mails",
      "conteudo": "Aprenda passo a passo como enviar e-mails para se comunicar com amigos e familiares. Passo 1: Abra o seu programa de e-mail. Passo 2: Clique em 'Escrever' ou 'Nova mensagem'. Passo 3: Digite o endereço de e-mail do destinatário na linha 'Para'. Passo 4: Escreva o assunto do e-mail na linha 'Assunto'. Passo 5: Digite sua mensagem na área de texto principal. Passo 6: Clique em 'Enviar' para enviar o e-mail.",
      "imagem": "img/email.png",
      "link": [
        "https://www.youtube.com/embed/tXo0mat5ofo"
      ],
      "categorias": [
        "Comunicação",
        "E-mail"
      ]
    },
    {
      "titulo": "Como navegar na Internet",
      "conteudo": "Saiba como navegar na internet para encontrar informações úteis e interessantes. Passo 1: Abra o seu navegador da web (por exemplo, Google Chrome, Mozilla Firefox). Passo 2: Na barra de endereços, digite o site que deseja visitar. Passo 3: Pressione 'Enter' para acessar o site. Passo 4: Use os botões 'Voltar' e 'Avançar' para navegar entre as páginas. Passo 5: Clique em links para acessar diferentes seções do site. Passo 6: Para pesquisar, digite sua consulta na barra de pesquisa e pressione 'Enter'.",
      "imagem": "img/Internet.png",
      "categorias": [],
      "id": "2"
    },
    {
      "id": "3",
      "titulo": "Uso do WhatsApp",
      "conteudo": "Aprenda a usar o WhatsApp para se comunicar por mensagens de texto, voz e vídeo. Passo 1: Abra o aplicativo WhatsApp em seu smartphone. Passo 2: Toque na conversa com a pessoa para quem deseja enviar uma mensagem. Passo 3: Na parte inferior da tela, digite sua mensagem no campo de texto. Passo 4: Toque no ícone de avião de papel para enviar a mensagem. Passo 5: Para fazer uma chamada de voz ou vídeo, toque no ícone do telefone ou câmera na parte superior da conversa.",
      "imagem": "img/whatsapp.png",
      "link": [
        "https://www.youtube.com/embed/dR5PNZhaLzU"
      ],
      "categorias": [
        "Comunicação",
        "Mensagens"
      ]
    },
    {
      "id": "4",
      "titulo": "Como usar o Zoom",
      "conteudo": "Descubra como participar de videochamadas usando o Zoom para se conectar com amigos e familiares. Passo 1: Baixe e instale o aplicativo Zoom em seu dispositivo. Passo 2: Abra o aplicativo Zoom. Passo 3: Clique em 'Entrar em uma reunião'. Passo 4: Insira o ID da reunião fornecido pelo organizador e clique em 'Entrar'. Passo 5: Aguarde a aprovação do host para ingressar na reunião. Passo 6: Uma vez dentro da reunião, clique em 'Iniciar vídeo' e 'Unir-se com o áudio' se desejar ativar sua câmera e microfone.",
      "imagem": "img/zoom.jpeg",
      "link": [
        "https://www.youtube.com/embed/rDn83qFODMU"
      ],
      "categorias": [
        "Comunicação",
        "Videoconferência"
      ]
    },
    {
      "titulo": "Como  utilizar o Facebook",
      "conteudo": "Saiba como utilizar o Facebook para se manter conectado com amigos e familiares e encontrar conteúdo interessante. Passo 1: Faça login na sua conta do Facebook. Passo 2: No feed de notícias, você verá postagens de seus amigos e páginas que segue. Passo 3: Para interagir com uma postagem, você pode clicar em 'Curtir', 'Comentar' ou 'Compartilhar'. Passo 4: Para encontrar amigos, use a barra de pesquisa no topo da página. Passo 5: Para publicar uma postagem, clique em 'Criar postagem' e digite o que deseja compartilhar.",
      "imagem": "img/facebook.webp",
      "categorias": [],
      "id": "5"
    },
    {
      "id": "6",
      "titulo": "Uso do Google Maps",
      "conteudo": "Saiba como ultilizar o Google Maps para encontrar rotas e explorar locais ao redor do mundo com facilidade. Passo 1: No celular abra o aplicativo do Google Maps. Passo 2: Digite o nome ou endereço na barra de busca e toque na lupa. Passo 3: Toque em Como chegar e depois coloque o ponto de partida e o destino. Passo 4: Siga as instruções no mapa para chegar ao destino. ",
      "imagem": "img/maps.png",
      "link": [
        "https://www.youtube.com/embed/xzOBLKpN9Zg"
      ],
      "categorias": [
        "Navegação",
        "Mapas"
      ]
    },
    {
      "id": "7",
      "titulo": "Como utilizar smartphones",
      "conteudo": "Saiba como ultilizar o smartphones para diversão e ultilidade no dia-a-dia. Passo 1: Ter um smartphone ou Iphone. Passo 2: Adicionar um ship caso seja necessário. Passo 3: Adicionar um número para ser de seu uso. Passo 4: Ter um plano mensal para poder ultilizar a internet. Passo 5: Baixar aplicativos do seu gosto e se divertir!",
      "imagem": "img/smartphone.jpg",
      "link": [
        "https://www.youtube.com/embed/AmAh5GRa_F8"
      ],
      "categorias": [
        "Tecnologia",
        "Celulares"
      ]
    },
    {
      "id": "8",
      "titulo": "Criando uma conta de e-mail",
      "conteudo": "Saiba como criar uma conta no email. Passo 1: Escolher um provedor seja ele Gmail, Outlook, Yahoo etc... Passo 2: Acessar o site do provedor escolhido. Passo 3: Encontrar a opção de criar conta. Passo 4: Preencher o formulário com as informações solicitadas, sejam elas do tipo Nome, Data de Nascimento, Senha etc... Passo 5: Verificar sua conta. Passo 6: Finalizar sua conta clicando em Criar conta, e pronto!!",
      "imagem": "img/conta.png",
      "link": [
        "https://www.youtube.com/embed/ovZjAF1HJVw"
      ],
      "categorias": [
        "E-mail",
        "Comunicação"
      ]
    },
    {
      "id": "9",
      "titulo": "Segurança na Internet",
      "conteudo": "Saiba como ter segurança usando a internet. Passo 1: Usar senhas longas e complexas, misturando letras, números e símbolos. Passo 2: Mantenha seus dispositivos e softwares sempre atualizados. Passo 3: Use redes Wi-Fi seguras e evite redes públicas sem proteção. Passo 4: Ajuste as configurações de privacidade das suas contas. Passo 5: Cuidado com ofertas e promoções que parecem boas demais para ser verdade.",
      "imagem": "img/securit.png",
      "link": [
        "https://www.youtube.com/embed/jK50H3HOMRE"
      ],
      "categorias": [
        "Segurança",
        "Internet"
      ]
    },
    {
      "id": "10",
      "titulo": "Utilizando o Skype",
      "conteudo": "Saiba como ultilizar o Skype e poder ter ligações e chamadas de vídeo com quem deseja! Passo 1: Baixe o Skype do site oficial e instale no seu dispositivo. Passo 2: Abra o Skype e crie uma conta ou faça login com uma conta existente. Passo 3: Para adicionar contatos procure e adicione contatos usando o nome, e-mail ou número de telefone. Passo 4: Para fazer chamada, selecione um contato e clique no ícone de chamada de voz ou vídeo. Passo 5: Para mandar mensagem clique em um contato e envie mensagens de texto no chat. ",
      "imagem": "img/skype.jpeg",
      "link": [
        "https://www.youtube.com/embed/w2bq772vtys"
      ],
      "categorias": [
        "Comunicação",
        "Videochamadas"
      ]
    },
    {
      "id": "11",
      "titulo": "Configurações básicas de computadores",
      "conteudo": "Saiba as configurações básicas dos computadores. Passo 1: Todo computador possui sua base que é chamada de CPU. Passo 2: Existe também a memória RAM da máquina que é usada para guardar e armazenar dados temporários. Passo 3: Tem o Disco Rígido que ele armazena dados permanentemente. Passo 4: Tem o Sistema Operacional que controla o hardware e permite que programas sejam executados. Passo 5: Existem os cabos e portas que conectam os componentes internos e externos do computador. ",
      "imagem": "img/computador.jpeg",
      "link": [
        "https://www.youtube.com/embed/F4WpaxCuJMU"
      ],
      "categorias": [
        "Tecnologia",
        "Computadores"
      ]
    },
    {
      "id": "12",
      "titulo": "Fazendo buscas na Internet",
      "conteudo": "Saiba como fazer buscas na internet, para encontrar tudo que deseja! Passo 1: Abra um Navegador: Como Chrome, Firefox, Safari, pois é nele onde tudo começa. Passo 2: Digite na Barra de Endereço ou Pesquisa: Coloque o que você quer procurar. Passo 3: Pressione Enter: Isso vai mostrar os resultados na tela. Passo 4: Clique nos Resultados: Escolha um link para ver mais informações o que mais lhe interessa.",
      "imagem": "img/pesquisa.jpeg",
      "link": [
        "https://www.youtube.com/embed/s2otpKflDAY"
      ],
      "categorias": [
        "Internet",
        "Pesquisa"
      ]
    }
  ],
  "mensagens": [
    {
      "conteudo": "Pessoal, estou com problemas para salvar novos contatos no meu telefone. Alguém sabe como fazer isso? Não estou conseguindo",
      "titulo": "Como salvar contatos",
      "autor": "Pedro",
      "id": "2"
    },
    {
      "id": "5",
      "titulo": "Como ativar o modo noturno",
      "conteudo": "Estou com dificuldades para encontrar a opção de ativar o modo noturno no meu telefone. Alguma dica?",
      "autor": "Mariana"
    },
    {
      "titulo": "OLa grupo",
      "autor": "neide",
      "conteudo": "achei muito legal a plataforma. ass Neide",
      "id": "f678"
    },
    {
      "id": "6581",
      "titulo": "Bom dia",
      "conteudo": "Que deus ilumine",
      "autor": "Neide Rocha de Silva"
    },
    {
      "id": "f695",
      "titulo": "Olá galera",
      "conteudo": "Saudação",
      "autor": "Neide Rocha de Silva"
    }
  ],
  "usuarios": [
    {
      "UserId": 1,
      "nome": "Alice",
      "nome_usuario": "alice01",
      "senha": "1234",
      "tipo_usuario": "admin",
      "id": "f25a",
      "foto": ""
    },
    {
      "UserId": 2,
      "nome": "Bob",
      "nome_usuario": "bob01",
      "senha": "1234",
      "tipo_usuario": "cliente",
      "id": "1fd4",
      "foto": ""
    },
    {
      "UserId": 3,
      "nome": "Charlie",
      "nome_usuario": "charlie01",
      "senha": "1234",
      "tipo_usuario": "cliente",
      "id": "d2b6",
      "foto": ""
    }
  ],
  "favoritos": [

  ]
}