{
  "perfil": [
    {
      "id": "1",
      "foto": "https://example.com/images/1.jpg",
      "nome": "Fulano de Tal",
      "Senha": "+55 11 98765-4321"
    },
    {
      "id": "2",
      "foto": "https://example.com/images/2.jpg",
      "nome": "Ciclano da Silva",
      "Senha": "+55 21 98765-4321"
    },
    {
      "id": "3",
      "foto": "https://example.com/images/3.jpg",
      "nome": "Beltrano dos Santos",
      "Senha": "+55 31 98765-4321"
    },
    {
      "id": "4",
      "foto": "https://example.com/images/4.jpg",
      "nome": "Ana Pereira",
      "Senha": "+55 41 98765-4321"
    },
    {
      "id": "5",
      "foto": "https://example.com/images/5.jpg",
      "nome": "Carlos Alberto",
      "Senha": "+55 51 98765-4321"
    },
    {
      "id": "6",
      "foto": "https://example.com/images/6.jpg",
      "nome": "Maria de Souza",
      "Senha": "+55 61 98765-4321"
    },
    {
      "id": "7",
      "foto": "https://example.com/images/7.jpg",
      "nome": "João Mendes",
      "Senha": "+55 71 98765-4321"
    },
    {
      "id": "8",
      "foto": "https://example.com/images/8.jpg",
      "nome": "Paula Rodrigues",
      "Senha": "+55 81 98765-4321"
    },
    {
      "id": "9",
      "foto": "https://example.com/images/9.jpg",
      "nome": "Roberto Lima",
      "Senha": "+55 91 98765-4321"
    },
    {
      "id": "10",
      "foto": "https://example.com/images/10.jpg",
      "nome": "Fernanda Costa",
      "Senha": "+55 19 98765-4321"
    },
    {
      "id": "11",
      "foto": "https://example.com/images/11.jpg",
      "nome": "Ricardo Barbosa",
      "Senha": "+55 27 98765-4321"
    },
    {
      "id": "12",
      "foto": "https://example.com/images/12.jpg",
      "nome": "Larissa Teixeira",
      "Senha": "+55 85 98765-4321"
    },
    {
      "id": "13",
      "foto": "https://example.com/images/13.jpg",
      "nome": "Gustavo Ferreira",
      "Senha": "+55 62 98765-4321"
    },
    {
      "id": "14",
      "foto": "https://example.com/images/14.jpg",
      "nome": "Mariana Almeida",
      "Senha": "+55 67 98765-4321"
    },
    {
      "id": "15",
      "foto": "https://example.com/images/15.jpg",
      "nome": "Pedro Henrique",
      "Senha": "+55 95 98765-4321"
    }
  ],
  "mensagensForum": [
    {
      "titulo": "Problemas com navegação em sites? Aqui estão algumas soluções!",
      "autor": "Vitor Tiradentes",
      "conteudo": " Olá pessoal, tenho enfrentado dificuldades ao navegar em alguns sites. As fontes são muito pequenas e os botões são difíceis de encontrar. Alguém mais passa por isso? Gostaria de compartilhar algumas soluções que encontrei. Uma delas é usar extensões de navegador que permitem aumentar o tamanho das fontes e até mesmo alterar as cores para melhorar a legibilidade. Outra opção é entrar em contato com os administradores do site e sugerir melhorias na acessibilidade. Vamos compartilhar nossas experiências e ajudar uns aos outros!",
      "id": "1"
    },
    {
      "id": "2",
      "autor": "Ciclano da Silva",
      "titulo": "Aplicativos úteis para idosos: compartilhe suas recomendações!",
      "conteudo": "Olá amigos, estou procurando aplicativos úteis para facilitar a vida dos idosos. Conheço alguns como aplicativos de lembretes de medicamentos e exercícios físicos, mas gostaria de descobrir mais opções. Vocês têm algum aplicativo favorito que gostariam de recomendar? Pode ser qualquer coisa, desde aplicativos de saúde até jogos educativos que ajudem a manter a mente ativa. Vamos compartilhar nossas descobertas e tornar a tecnologia mais acessível para todos!"
    },
    {
      "id": "3",
      "autor": "Maria Souza",
      "titulo": "Configurações para melhorar a leitura em telas: como vocês fazem?",
      "conteudo": "Olá pessoal, minha mãe tem dificuldade em ler em telas de dispositivos móveis. Encontrei algumas configurações úteis, como aumentar o tamanho da fonte e usar temas de alto contraste, mas ainda estamos buscando mais soluções. Alguém já passou por isso e encontrou outras formas de facilitar a leitura para idosos? Vamos compartilhar nossas dicas!"
    },
    {
      "id": "4",
      "autor": "João Pereira",
      "titulo": "Navegadores amigáveis para idosos: recomendações?",
      "conteudo": "Olá a todos, meu pai está aprendendo a usar a internet, mas ele acha os navegadores complicados. Estou procurando navegadores com interfaces simplificadas e ícones maiores que sejam mais acessíveis para idosos. Vocês conhecem alguma opção que seja fácil de usar? Agradeço qualquer sugestão!"
    },
    {
      "id": "5",
      "autor": "Laura Fernandes",
      "titulo": "Configurações de navegação que ajudam os idosos: sugestões?",
      "conteudo": "Oi pessoal! Minha avó acha difícil clicar em pequenos botões e menus na internet. Encontrei algumas opções para aumentar o zoom e configurar a navegação por voz, mas ainda estou procurando mais dicas. Vocês conhecem outras configurações que ajudam a navegação para idosos? Vamos compartilhar!"
    },
    {
      "id": "6",
      "autor": "Pedro Alves",
      "titulo": "Aplicativos de comunicação mais acessíveis para idosos?",
      "conteudo": "Olá comunidade! Minha tia tem dificuldade com aplicativos de mensagens por causa dos botões pequenos. Procuro apps com teclas maiores e interfaces simples. Vocês conhecem aplicativos de mensagens ou chamadas que sejam amigáveis para idosos? Compartilhem suas sugestões!"
    }
  ]
}